Тест/Тест/src/Catalogs/ВложенияВолжска/ВложенияВолжска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВложенияВолжска</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплаченоПоКредиту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсталосьОтбить</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусКредита</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Погашения</name>
    <attributes>
      <name>ДокументРасхода</name>
      <type>
        <types>DocumentRef.Расходы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/Documents/ПриходОтКредитов/ПриходОтКредитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходОтКредитов</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>КредитВБанке</name>
    <type>
      <types>CatalogRef.ВложенияВолжска</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусКредита</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Тест/Тест/src/Catalogs/ВложенияВолжска/Forms/ФормаЭлемента/Module.bsl
//Мазин -----------------------------------Начало
&НаКлиенте
Процедура СуммаДолгаПриИзменении(Элемент)
	СуммаДолгаПриИзмененииНаСервере();
	СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СуммаДолгаПриИзмененииНаСервере()
			
//Перебор таблицы Справочника Кредит (ВложенияВолжская) и заполнение реквизитов
 		СуммаПлатежей = 0; 
 	Для Каждого СтрокаТЧ ИЗ Объект.Погашения Цикл 
 		СуммаПлатежей= СуммаПлатежей + СтрокаТЧ.Сумма;  	
 	КонецЦикла;
 		Объект.ОплаченоПоКредиту = СуммаПлатежей; 
 		Объект.ОсталосьОтбить = Объект.СуммаДолга - СуммаПлатежей; 
	
// Реквизит Статус справочника Кредит (ВложенияВолжская)		
		Если Объект.ОсталосьОтбить <= 0 ТОГДА 
			Объект.Статус = Перечисления.СтатусКредита.Закрыто;
		ИНАЧЕ 
			Объект.Статус = Перечисления.СтатусКредита.Открыто 
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииНаСервере()
// Заполнение реквизита - Статус в документе ПриходОтКредитов

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходОтКредитов.Ссылка КАК СсылкаКред
	|ИЗ
	|	Документ.ПриходОтКредитов КАК ПриходОтКредитов
	|ГДЕ
	|	ПриходОтКредитов.КредитВБанке = &КредитВБанке";

Запрос.УстановитьПараметр("КредитВБанке", Объект.Ссылка);

РезультатЗапроса = Запрос.Выполнить();
	СсылкаНаПриходКред=Неопределено;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
	СсылкаНаПриходКред =ВыборкаДетальныеЗаписи.СсылкаКред; 
КонецЦикла;

Попытка
ОбъектПриходОтКредитов = СсылкаНаПриходКред.ПолучитьОбъект(); 
ОбъектПриходОтКредитов.Статус = Объект.Статус; 
ОбъектПриходОтКредитов.Записать(); 
Исключение
Сообщение = Новый СообщениеПользователю; 
Сообщение.Текст = "Не Забудте Создать Документ Приход От Кредитов";
Сообщение.Сообщить();
КонецПопытки
КонецПроцедуры




//Мазин -----------------------------------Конец
